In [53]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib as mpl
import matplotlib.pyplot as plt

In [54]:
Titanic = sns.load_dataset('titanic')
Titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

- a. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오.
- category1 카테고리는 다음과 같이 정의됨
- 1) 20살이 넘으면 성별을 그대로 사용한다.
- 2) 20살 미만이면 성별에 관계없이 “child”라고 한다.

In [55]:
Titanic['category1'] = Titanic.apply(lambda x: x.sex
    if x.age >= 20 else "child", axis=1) # 3항 연산자 매우 중요
Titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

- b. 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고치시오

In [56]:
Titanic.age = Titanic.age.fillna(Titanic.age.mean())
Titanic['category1'] = Titanic.apply(lambda x: x.sex if x.age >= 20 else "child", axis=1)
Titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.000000,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.000000,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,29.699118,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,female
889,1,1,male,26.000000,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.000000,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

In [57]:
res = Titanic.describe()
res

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  891.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   13.002015    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   22.000000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   29.699118    0.000000    0.000000   14.454200
75%      1.000000    3.000000   35.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [58]:
res.age[1].round(0)

30.0

- age NaN 값인 부분에 평균 나이 넣어주기

In [59]:
# 888번 NaN 값이었는데 30으로 잘 바뀜
Titanic['age'] = Titanic['age'].fillna(res.age[1].round(0))
Titanic['age'] = Titanic['age'].round(0)
Titanic.tail(4)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,30.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,female
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

In [60]:
# alive_mask1 = Titanic['alive'] =="yes"
# Titanic.loc[alive_mask1, 'alive'] = 1
# alive_mask2 = Titanic['alive'] =="no"
# Titanic.loc[alive_mask2, 'alive'] = 0
# Titanic.head()

- c. 성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.

- 성별, 선실별, 출발지별로 survived 수를 묶고 이를 각 기준별 항목수(count)로 나눠준다.

In [61]:
Titanic.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [62]:
a = Titanic.groupby('sex').sum() / Titanic.groupby('sex').count()
b = Titanic.groupby('class').sum() / Titanic.groupby('class').count()
c = Titanic.groupby('embark_town').sum() / Titanic.groupby('embark_town').count()
a

,adult_male,age,alive,alone,category1,class,deck,embark_town,embarked,fare,parch,pclass,sibsp,survived,who
sex,,,,,,,,,,,,,,,
female,0.000000,28.264331,NaN,0.401274,NaN,NaN,NaN,NaN,NaN,44.479818,0.649682,2.159236,0.694268,0.742038,NaN
male,0.930676,30.564991,NaN,0.712305,NaN,NaN,NaN,NaN,NaN,25.523893,0.235702,2.389948,0.429809,0.188908,NaN

- 성별 생존율

In [63]:
a_df = pd.DataFrame(a.survived)
a_df.columns=["survival_rate"]
a_df

        survival_rate
sex
female       0.742038
male         0.188908

- 선실(class)별 생존율

In [64]:
b_df = pd.DataFrame(b.survived)
b_df.columns=["survival_rate"]
b_df

        survival_rate
class
First        0.629630
Second       0.472826
Third        0.242363

- 출발지 (embarked_town)별 생존율

In [65]:
c_df = pd.DataFrame(c.survived)
c_df.columns=["survival_rate"]
c_df

             survival_rate
embark_town
Cherbourg         0.553571
Queenstown        0.389610
Southampton       0.336957

In [66]:
Titanic.groupby(['sex','pclass'])['survived'].mean()

sex     pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: survived, dtype: float64

## MPG 문제

In [67]:
mpg = sns.load_dataset('mpg')
mpg.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

In [68]:
mpg['hp_per_cc'] = mpg.horsepower / mpg.displacement
mpg.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,0.471698

In [69]:
# 3-b.
name = 'chevrolet chevelle malibu'
manu = name.split()[0]
manu

'chevrolet'

In [70]:
name.split()

['chevrolet', 'chevelle', 'malibu']

In [71]:
# len = len['name']
# len

In [72]:
# name[len+1:]

In [73]:
name.split()[1:]

['chevelle', 'malibu']

In [74]:
', '.join(name.split()[1:])

'chevelle, malibu'

In [75]:
mpg['manu'] = mpg.name.apply(lambda x : x.split()[0])
mpg['model'] = mpg.name.apply(lambda x: ' '.join(x.split()[1:]))

In [76]:
mpg.groupby('cylinders')['mpg'].mean()

cylinders
3    20.550000
4    29.286765
5    27.366667
6    19.985714
8    14.963107
Name: mpg, dtype: float64

In [77]:
mpg.groupby('origin')['hp_per_cc'].mean()

origin
europe    0.740005
japan     0.789485
usa       0.512063
Name: hp_per_cc, dtype: float64

In [78]:
# 3-e 모델이 5개 이상인 제조사
mpg.groupby('manu')['model'].count()

manu
amc              28
audi              7
bmw               2
buick            17
cadillac          2
capri             1
chevroelt         1
chevrolet        43
chevy             3
chrysler          6
datsun           23
dodge            28
fiat              8
ford             51
hi                1
honda            13
maxda             2
mazda            10
mercedes          1
mercedes-benz     2
mercury          11
nissan            1
oldsmobile       10
opel              4
peugeot           8
plymouth         31
pontiac          16
renault           5
saab              4
subaru            4
toyota           25
toyouta           1
triumph           1
vokswagen         1
volkswagen       15
volvo             6
vw                6
Name: model, dtype: int64

In [79]:
mpg.manu.value_counts() # sorting 돼서 결과 나오는데,series임.

ford             51
chevrolet        43
plymouth         31
amc              28
dodge            28
toyota           25
datsun           23
buick            17
pontiac          16
volkswagen       15
honda            13
mercury          11
mazda            10
oldsmobile       10
fiat              8
peugeot           8
audi              7
chrysler          6
vw                6
volvo             6
renault           5
saab              4
subaru            4
opel              4
chevy             3
bmw               2
cadillac          2
maxda             2
mercedes-benz     2
triumph           1
vokswagen         1
mercedes          1
hi                1
capri             1
chevroelt         1
toyouta           1
nissan            1
Name: manu, dtype: int64

In [80]:
s = mpg.manu.value_counts()
s[s >= 5]

ford          51
chevrolet     43
plymouth      31
amc           28
dodge         28
toyota        25
datsun        23
buick         17
pontiac       16
volkswagen    15
honda         13
mercury       11
mazda         10
oldsmobile    10
fiat           8
peugeot        8
audi           7
chrysler       6
vw             6
volvo          6
renault        5
Name: manu, dtype: int64

In [81]:
big_manu = s[s >= 5].index
big_manu

Index(['ford', 'chevrolet', 'plymouth', 'amc', 'dodge', 'toyota', 'datsun',
       'buick', 'pontiac', 'volkswagen', 'honda', 'mercury', 'mazda',
       'oldsmobile', 'fiat', 'peugeot', 'audi', 'chrysler', 'vw', 'volvo',
       'renault'],
      dtype='object')

In [82]:
'ford' in big_manu # big manufacturer에 포함되는지 확인하려면 in으로 확인하면 됨.

True

In [83]:
# 전체 데이터 중에서 모델이 5개 이상인 제조사만 filtering
big_mpg =  mpg[mpg.manu.isin(big_manu)]
mpg.shape, big_mpg.shape

((398, 12), (367, 12))

In [84]:
big_mpg.groupby('manu')['mpg'].mean().sort_values(ascending=False).head()

manu
vw         39.016667
honda      33.761538
renault    32.880000
datsun     31.113043
mazda      30.860000
Name: mpg, dtype: float64

### 복잡한 자료 구조에서 데이터 꺼내오기

#### Q1) 아래의 결과에서 roadAddr 값을 가져오는 코드를 작성하세요.

In [85]:
    result = {'results': {'common': {'errorMessage': '정상',
    'countPerPage': '10',
    'totalCount': '1',
    'errorCode': '0',
    'currentPage': '1'},
    'juso': [{'detBdNmList': '',
    'engAddr': '768, Bijarim-ro, Jocheon-eup, Jeju-si, Jeju-do',
    'rn': '비자림로',
    'emdNm': '조천읍',
    'zipNo': '63346',
    'roadAddrPart2': '',
    'emdNo': '02',
    'sggNm': '제주시',
    'jibunAddr': '제주특별자치도 제주시 조천읍 교래리 342-2 산굼부리',
    'siNm': '제주특별자치도',
    'roadAddrPart1': '제주특별자치도 제주시 조천읍 비자림로 768',
    'bdNm': '산굼부리',
    'admCd': '5011025929',
    'udrtYn': '0',
    'lnbrMnnm': '342',
    'roadAddr': '제주특별자치도 제주시 조천읍 비자림로 768',
    'lnbrSlno': '2',
    'buldMnnm': '768',
    'bdKdcd': '0',
    'liNm': '교래리',
    'rnMgtSn': '501103349079',
    'mtYn': '0',
    'bdMgtSn': '5011025929003420005071420',
    'buldSlno': '0'}]}}

In [86]:
# 딕셔너리 형태, 여기서 키 값은 어떻게 확인?
result.keys()

dict_keys(['results'])

In [87]:
type(result['results']) # 딕셔너리 형태

dict

In [88]:
(result['results']).keys()

dict_keys(['common', 'juso'])

In [89]:
type(result['results']['juso']) # 딕셔너리의 juso 는 리스트 형태

list

In [90]:
result['results']['juso'][0]

{'detBdNmList': '',
 'engAddr': '768, Bijarim-ro, Jocheon-eup, Jeju-si, Jeju-do',
 'rn': '비자림로',
 'emdNm': '조천읍',
 'zipNo': '63346',
 'roadAddrPart2': '',
 'emdNo': '02',
 'sggNm': '제주시',
 'jibunAddr': '제주특별자치도 제주시 조천읍 교래리 342-2 산굼부리',
 'siNm': '제주특별자치도',
 'roadAddrPart1': '제주특별자치도 제주시 조천읍 비자림로 768',
 'bdNm': '산굼부리',
 'admCd': '5011025929',
 'udrtYn': '0',
 'lnbrMnnm': '342',
 'roadAddr': '제주특별자치도 제주시 조천읍 비자림로 768',
 'lnbrSlno': '2',
 'buldMnnm': '768',
 'bdKdcd': '0',
 'liNm': '교래리',
 'rnMgtSn': '501103349079',
 'mtYn': '0',
 'bdMgtSn': '5011025929003420005071420',
 'buldSlno': '0'}

In [91]:
result['results']['juso'][0]['roadAddr']

'제주특별자치도 제주시 조천읍 비자림로 768'

#### Q2) 아래의 결과에서 x와 y의 값을 가져오는 코드를 작성하세요.

In [92]:
result2 = {'documents': [{'address': {'address_name': '강원 강릉시 저동 94',
    'b_code': '4215013700',
    'h_code': '4215066500',
    'main_address_no': '94',
    'mountain_yn': 'N',
    'region_1depth_name': '강원',
    'region_2depth_name': '강릉시',
    'region_3depth_h_name': '경포동',
    'region_3depth_name': '저동',
    'sub_address_no': '',
    'x': '128.896538649542',
    'y': '37.7955687639648'},
   'address_name': '강원 강릉시 경포로 365',
   'address_type': 'ROAD_ADDR',
   'road_address': {'address_name': '강원 강릉시 경포로 365',
    'building_name': '경포대',
    'main_building_no': '365',
    'region_1depth_name': '강원',
    'region_2depth_name': '강릉시',
    'region_3depth_name': '저동',
    'road_name': '경포로',
    'sub_building_no': '',
    'underground_yn': 'N',
    'x': '128.896538649542',
    'y': '37.7955687639648',
    'zone_no': '25461'},
   'x': '128.896538649542',
   'y': '37.7955687639648'}],
 'meta': {'is_end': True, 'pageable_count': 1, 'total_count': 1}}

In [93]:
result2.keys()

dict_keys(['documents', 'meta'])

In [94]:
type(result2['documents'])

list

In [95]:
result2['documents'][0]['x']

'128.896538649542'

In [96]:
lng = float(result2['documents'][0]['x'])
lat = float(result2['documents'][0]['y'])
lng, lat

(128.896538649542, 37.7955687639648)

- 자료 구조가 잘 정립되어 있지 않으면 찾아가기 힘들다 !
- 딕셔너리, 리스트, 넘파이, 데이터프레임은 완벽하게 마스터를 해 놔야 나아갈 수 있음.